{"config": [{"config": {"units": 12, "batch_input_shape": [null, 46], "bias_regularizer": null, "name": "dense_1", "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "stddev": 1.0, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "bias_constraint": null, "activity_regularizer": null, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 8, "bias_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "name": "dense_2", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 1, "bias_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "activation": "linear", "name": "dense_3", "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.1.2-tf", "class_name": "Sequential", "backend": "tensorflow"}